InformationRegisters/МесячныйРасчетныйПоказатель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МесячныйРасчетныйПоказатель</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерДляПособийИныхСоциальныхВыплат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МесячныйРасчетныйПоказатель/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция предназначена для получения данных о месячном расчетном показателе.
// Данные включают в себя сам размер и дату, с которой он действует.
//
// Параметры:
//	ДатаАктуальности - дата, на которую нужно получить размер МРП (необязательный), 
//						если не заполнен, возвращается последнее действующее значение.
//
// Возвращаемое значение - структура, полями которой являются Размер и Период.
//
Функция ДанныеРазмераМесячногоРасчетногоПоказателя(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеМРП = Новый Структура("Размер, Период");
	
	СрезПоследних = РегистрыСведений.МесячныйРасчетныйПоказатель.СрезПоследних(ДатаАктуальности);
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Сведения о месячном расчетном показателе не заполнены'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеМРП, СрезПоследних[0]);
	
	Возврат ДанныеМРП;
	
КонецФункции

Функция ДанныеРазмераДляПособийИныхСоциальныхВыплат(ДатаАктуальности = Неопределено) Экспорт
	
	ДанныеМРП = Новый Структура("РазмерДляПособийИныхСоциальныхВыплат, Период");
	
	СрезПоследних = РегистрыСведений.МесячныйРасчетныйПоказатель.СрезПоследних(ДатаАктуальности);
	Если СрезПоследних.Количество() = 0 Тогда
		ВызватьИсключение НСтр("ru = 'Сведения о месячном расчетном показателе не заполнены'");
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ДанныеМРП, СрезПоследних[0]);
	
	Возврат ДанныеМРП;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Начальное заполнение и обновление информационной базы 
Процедура НачальноеЗаполнение() Экспорт
	
	Если ОбменДаннымиПовтИсп.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;
	
	Обновить(ПолучитьМакет("ПредопределенныеЗначения").ПолучитьТекст());
	
КонецПроцедуры

// Заполняет ставки месячного расчетного показателя.
Процедура Обновить(ТекстXML) Экспорт
	ЗарплатаКадры.ОбновитьКлассификатор(ТекстXML);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СервисКлассификаторов

Процедура ОбновитьИзСервиса(Идентификатор, ДанныеКлассификатора) Экспорт
	
	Если Идентификатор <> ИдентификаторКлассификатора() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();

	Попытка

		ОбработанныеДанные = ОбработанныеДанные(ДанныеКлассификатора); 	
		РанняяДатаВКлассификаторе = РанняяДатаВКлассификаторе(ОбработанныеДанные); 
		СохраняемыйНабор = СохраняемыйНабор(РанняяДатаВКлассификаторе);
		
		НаборЗаписей = РегистрыСведений.МесячныйРасчетныйПоказатель.СоздатьНаборЗаписей(); 	
		
		Для Каждого Элемент Из СохраняемыйНабор Цикл 
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
		КонецЦикла;
		
		Для Каждого Элемент Из ОбработанныеДанные Цикл 
			Запись = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Элемент);
		КонецЦикла;

        ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
								
		Обработан = Истина;  
						
		ЗафиксироватьТранзакцию();
	Исключение	
		ОтменитьТранзакцию();
		
		Обработан = Ложь;
		
		ЗаписьЖурналаРегистрации("ЗагрузкаКлассификатора",
			УровеньЖурналаРегистрации.Ошибка, РегистрыСведений.МесячныйРасчетныйПоказатель,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ИдентификаторКлассификатора() Экспорт
	
	Возврат "ReglIndicatorsKz";
	
КонецФункции 

Функция ОбработанныеДанные(ДанныеИзСервиса)
	
	Данные = Новый Массив; 
	
	Для Каждого Элемент Из ДанныеИзСервиса Цикл
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("Период", ПрочитатьДатуJSON(Элемент.period, ФорматДатыJSON.ISO));
		СтруктураДанных.Вставить("Размер", Элемент.mrp);
        СтруктураДанных.Вставить("РазмерДляПособийИныхСоциальныхВыплат", Элемент.mrpSocialBenefits);
       
		Данные.Добавить(СтруктураДанных);
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

Функция РанняяДатаВКлассификаторе(Данные)
	
	МинимальнаяДата = Неопределено;
	Для Каждого Элемент Из Данные Цикл
		Если МинимальнаяДата = Неопределено Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
		Если Элемент.Период < МинимальнаяДата Тогда
			МинимальнаяДата = Элемент.Период;
		КонецЕсли;
	КонецЦикла;

	Возврат МинимальнаяДата;
	
КонецФункции  

Функция СохраняемыйНабор(Дата) 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МесячныйРасчетныйПоказатель.Период КАК Период,
		|	МесячныйРасчетныйПоказатель.Размер КАК Размер,
		|	МесячныйРасчетныйПоказатель.РазмерДляПособийИныхСоциальныхВыплат КАК РазмерДляПособийИныхСоциальныхВыплат
        |ИЗ
		|	РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказатель
		|ГДЕ
		|	МесячныйРасчетныйПоказатель.Период < &Период";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	УстановитьПривилегированныйРежим(Истина);
	Выборка = Запрос.Выполнить().Выбрать();		
	УстановитьПривилегированныйРежим(Ложь); 
	
	СохраняемыйНабор = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		ДанныеНабора = Новый Структура; 
		ДанныеНабора.Вставить("Период", Выборка.Период);
		ДанныеНабора.Вставить("Размер", Выборка.Размер);
		ДанныеНабора.Вставить("РазмерДляПособийИныхСоциальныхВыплат", Выборка.РазмерДляПособийИныхСоциальныхВыплат);
		
		СохраняемыйНабор.Добавить(ДанныеНабора);
	КонецЦикла;

	Возврат СохраняемыйНабор; 
	
КонецФункции

#КонецОбласти

// Проверяет заполненность данных о месячном расчетном показателе.
//
// Возвращаемое значение - булево, Истина - если есть хотя бы одно значение.
//
Функция МесячныйРасчетныйПоказательЗаполнен() Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК Поле1
	|ИЗ
	|	РегистрСведений.МесячныйРасчетныйПоказатель КАК МесячныйРасчетныйПоказатель");
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#КонецЕсли
